tobozo/ESP32-PsRamFS/src/pfs.c
int pfs_get_max_items()
{
  return pfs_max_items;
}


void pfs_set_max_items(size_t max_items)
{
  ESP_LOGD(TAG, "Setting max items to %d", pfs_max_items);
  pfs_max_items = max_items;
}


int pfs_get_block_size()
{
  return pfs_alloc_block_size;
}


void pfs_set_block_size(size_t block_size)
{
  ESP_LOGD(TAG, "Setting alloc block size to %d", block_size);
  pfs_alloc_block_size = block_size;
}


void pfs_set_alloc_functions()
{
  #ifdef BOARD_HAS_PSRAM
    if (esp_spiram_init() != ESP_OK) {
      ESP_LOGE(TAG, "Can't init psram :-(");
      pfs_psram_enabled = false;
    }
    if( pfs_psram_enabled ) {
      ESP_LOGD(TAG, "pfs will use psram");
      pfs_malloc    = p_malloc;
      pfs_realloc   = p_realloc;
      pfs_calloc    = p_calloc;
      pfs_free_mem  = p_free;
      pfs_set_max_items( 256 );
      pfs_set_block_size( 4096 );
    } else {
      ESP_LOGD(TAG, "pfs will use heap by config");
      pfs_malloc    = i_malloc;
      pfs_realloc   = i_realloc;
      pfs_calloc    = i_calloc;
      pfs_free_mem  = i_free;
      pfs_set_max_items( 16 );
      pfs_set_block_size( 512 );
    }
  #else // ! BOARD_HAS_PSRAM
    ESP_LOGD(TAG, "pfs will use heap");
    pfs_psram_enabled = false;
    pfs_malloc    = i_malloc;
    pfs_realloc   = i_realloc;
    pfs_calloc    = i_calloc;
    pfs_free_mem  = i_free;
    pfs_set_max_items( 16 );
    pfs_set_block_size( 512 );
  #endif
}


void pfs_set_psram( bool use )
{
  ESP_LOGD(TAG, "%s psram...", use ? "Enabling" : "Disabling");
  pfs_psram_enabled = use;
}


bool pfs_get_psram()
{
  return pfs_psram_enabled;
}


void pfs_set_partition_size( size_t size )
{
  pfs_partition_size = size;
}


size_t pfs_get_partition_size()
{
  return pfs_partition_size;
}


void pfs_init_files( const char* partition_label )
{
  pfs_set_psram( pfs_psram_enabled );
  pfs_set_alloc_functions();

  pfs_files = (pfs_file_t**)pfs_calloc( pfs_max_items, sizeof( pfs_file_t* ) );
  if( pfs_files == NULL ) {
    ESP_LOGE(TAG, "Unable to init pfs, halting");
    while(1);
  }
  for( int i=0; i<pfs_max_items; i++ ) {
    pfs_files[i] = (pfs_file_t*)pfs_calloc( 1, sizeof( pfs_file_t ) );
    if( pfs_files[i] == NULL ) {
      ESP_LOGE(TAG, "Unable to init pfs, halting");
      while(1);
    }
  }
  // this may be redundant with vfs properties
  if( pfs_partition_label != NULL ) free(pfs_partition_label);
  pfs_partition_label = (char*)calloc( 1, strlen( partition_label )+1 );
  snprintf( (char*)pfs_partition_label, strlen( partition_label ), "%s", partition_label );

  ESP_LOGD(TAG, "Init files OK");
}


void pfs_init_dirs()
{
  pfs_dirs = (pfs_dir_t **)pfs_calloc( pfs_max_items, sizeof( pfs_dir_t* ) );
  if( pfs_dirs == NULL ) {
    ESP_LOGE(TAG, "Unable to init pfs, halting");
    while(1);
  }
  for( int i=0; i<pfs_max_items; i++ ) {
    pfs_dirs[i] = (pfs_dir_t*)pfs_calloc( 1, sizeof( pfs_dir_t ) );
    if( pfs_dirs[i] == NULL ) {
      ESP_LOGE(TAG, "Unable to init pfs, halting");
      while(1);
    }
  }
  ESP_LOGD(TAG, "Init dirs OK");
}


int pfs_next_file_avail()
{
  int res = 0;
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name == NULL ) {
        ESP_LOGV(TAG, "File Slot %d out of %d is free [r]", i, pfs_max_items );
        return i;
      }
    }
    ESP_LOGE(TAG, "Too many files created.");
  } else {
    ESP_LOGE(TAG, "No allocated space for files");
  }
  return res;
}


int pfs_next_dir_avail()
{
  int res = 0;
  if( pfs_dirs != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_dirs[i]->name == NULL ) {
        ESP_LOGV(TAG, "Dir Slot %d out of %d is free [r]", i, pfs_max_items );
        return i;
      }
    }
    ESP_LOGE(TAG, "Too many dirs created, halting");
    while(1);
  } else {
    ESP_LOGE(TAG, "No allocated space for dirs");
  }
  return res;
}


int pfs_find_file( const char* path )
{
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name == NULL ) continue;
      if( strcmp( path, pfs_files[i]->name ) == 0 ) {
        return i;
      }
    }
  }
  return -1;
}


int pfs_find_dir( const char* path )
{
  if( pfs_dirs != NULL ) {
    unsigned long entitycount = 0;
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_dirs[i]->name == NULL ) continue;
      if( strcmp( path, pfs_dirs[i]->name ) == 0 ) {
        return i;
      }
    }
  } else {
    ESP_LOGW(TAG, "Call on pfs_find_dir() before pfs_dirs are allocated");
  }
  return -1;
}


size_t pfs_used_bytes()
{
  size_t totalsize = 0;
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name != NULL ) {
        totalsize += pfs_files[i]->size;
        //ESP_LOGV(TAG, "Adding %d bytes from %s (total=%d)", pfs_files[i]->size, pfs_files[i]->name, totalsize );
      }
    }
  } else {
    ESP_LOGW(TAG, "Call on used_bytes() before pfs_files are allocated");
  }
  return totalsize;
}


int pfs_stat( const char * path, struct stat * stat_ )
{
  assert(path);

  //if( stat_ == NULL ) {
  //  stat_ = pfs_calloc(1, sizeof(* stat_));
  //} else {
    memset(stat_, 0, sizeof(* stat_));
  //}

  if(path == NULL) {
    ESP_LOGW(TAG, "NOT stating for null path");
    return 1;
  }

  int file_id = pfs_find_file( path );
  if( file_id > -1 ) {
    //stat_->st_ino     = file_id;
    stat_->st_size    = pfs_files[file_id]->size;
    //stat_->st_blksize = pfs_alloc_block_size;
    //stat_->st_blocks  = (pfs_files[file_id]->size/pfs_alloc_block_size) + 1;
    stat_->st_mode    = S_IRWXU | S_IRWXG | S_IRWXO | S_IFREG;
    stat_->st_mode    = S_IFREG;
    //stat_->st_gid     = 0;
    //stat_->st_mtime = 0;
    //stat_->st_atime = 0;
    //stat_->st_ctime = 0;

    // pfs_files[file_id]->flags |=
    // pfs_files[file_id]->flags &= ~
    // pfs_files[file_id]->flags &= ~PFS_F_WRITING;
    // pfs_files[file_id]->flags |= PFS_F_DIRTY;
    ESP_LOGD(TAG, "stating for DT_REG(%s) success (size=%d)", path, pfs_files[file_id]->size );
    return 0;
  } else {
    ESP_LOGD(TAG, "stating for DT_REG(%s) no pass", path );
  }

  int dir_id = pfs_find_dir( path );
  if( dir_id > -1 ) {
    stat_->st_size = 0;
    //stat_->st_mode = S_IFDIR;//DT_DIR or S_IFDIR ?;
    stat_->st_mode    = S_IRWXU | S_IRWXG | S_IRWXO | S_IFDIR;
    stat_->st_mode    = S_IFDIR;
    ESP_LOGD(TAG, "stating for DT_DIR(%s) success", path );
    return 0;
  } else {
    ESP_LOGD(TAG, "stating for DT_DIR(%s) no pass", path );
  }

