tobozo/ESP32-PsRamFS/src/pfs.c
int pfs_fflush(pfs_file_t * stream)
{
  ESP_LOGW("[FIXME] Flushing (actually does nothing)");
  return 0;
}


int pfs_fseek( pfs_file_t * stream, off_t offset, pfs_seek_mode mode )
{
  if( offset < 0 ) offset = 0; // dafuq ?

  switch( mode ) {
    case pfs_seek_set: // 0
      if( offset < stream->size ) {
        stream->index = offset;
        ESP_LOGV(TAG, "Seeking mode #%d (seekset) with offset(%d)/size(%d)/index(%d)", mode, offset, stream->size, stream->index );
      } else {
        stream->index = stream->size;
        ESP_LOGE(TAG, "Seeking mode #%d (seekset) with capped offset(%d)/size(%d)/index(%d)", mode, offset, stream->size, stream->index );
        return -1;
      }
    break;
    case pfs_seek_cur: // 1
      if( stream->index + offset <= stream->size ) {
        stream->index += offset;
        ESP_LOGV(TAG, "Seeking mode #%d (seekcur) with offset(%d)/size(%d)/index(%d)", mode, offset, stream->size, stream->index );
      } else {
        stream->index = stream->size;
        ESP_LOGE(TAG, "Seeking mode #%d (seekcur) with truncated offset(%d)/size(%d)/index(%d)", mode, offset, stream->size, stream->index );
        return -1;
      }
    break;
    case pfs_seek_end: // 2
      if( offset == 0 ) {
        stream->index = stream->size;
      } else {
        if( offset <= stream->size ) {
          stream->index = stream->size - offset;
        } else {
          stream->index = 0;
          ESP_LOGE(TAG, "Seeking mode #%d (seekend) with truncated offset(%d)/size(%d)/index(%d)", mode, offset, stream->size, stream->index );
          return -1;
        }
      }
      ESP_LOGV(TAG, "Seeking mode #%d (seekend) with offset(%d)/size(%d)/index(%d)", mode, offset, stream->size, stream->index );
    break;
  }
  return 0;
}


size_t pfs_ftell( pfs_file_t * stream )
{
  if( stream == NULL ) {
    ESP_LOGE(TAG, "Invalid stream");
    return -1;
  }
  ESP_LOGD(TAG, "Ftelling index %d", stream->index);
  return stream->index;
}


void pfs_fclose( pfs_file_t * stream )
{
  if( stream->size < 128 ) {
    ESP_LOGD(TAG, "Closing stream %s (%d bytes) contents: %s\n", stream->name, stream->size, (const char*)stream->bytes);
  } else {
    ESP_LOGD(TAG, "Closing stream %s (%d bytes)\n", stream->name, stream->size );
  }
  stream->index = 0;
  return;
}


int pfs_unlink( const char * path )
{
  int file_id = pfs_find_file( path );
  if( file_id > -1 ) {
    free( pfs_files[file_id]->name );
    pfs_files[file_id]->name = NULL;
    if( pfs_files[file_id]->bytes != NULL ) {
      free( pfs_files[file_id]->bytes );
      pfs_files[file_id]->bytes = NULL;
    }
    pfs_files[file_id]->size = 0;
    pfs_files[file_id]->memsize = 0;
    pfs_files[file_id]->index = 0;
    pfs_files[file_id]->file_id = -1;
    ESP_LOGD(TAG, "Path %s unlinked successfully", path);
    return 0;
  }
  ESP_LOGW(TAG, "Path %s not found, can't unlink", path);
  return 1;
}


void pfs_free()
{
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name != NULL ) {
        pfs_unlink( pfs_files[i]->name );
        free( pfs_files[i] );
      }
    }
  }
  if( pfs_dirs != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_dirs[i]->name != NULL ) {
        //pfs_unlink( pfs_files[i]->name );
        free( pfs_dirs[i]->name );
        pfs_dirs[i]->name = NULL;
        free( pfs_dirs[i] );
      }
    }
  }
  if( pfs_files != NULL ) {
    free( pfs_files );
    pfs_files = NULL;
  }
  if( pfs_dirs  != NULL ) {
    free( pfs_dirs );
    pfs_dirs = NULL;
  }
  if( pfs_partition_label != NULL ) {
    free( pfs_partition_label );
    pfs_partition_label = NULL;
  }
}


void pfs_clean_files()
{
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name != NULL ) {
        pfs_unlink( pfs_files[i]->name );
      }
    }
  }
}


int pfs_rename( const char * from, const char * to )
{
  int file_id = pfs_find_file( to );
  if( file_id > -1 ) {
    // destination file already exists, unlink first ?
    return -1;
  }
  file_id = pfs_find_file( from );
  if( file_id > -1 ) {
    free( pfs_files[file_id]->name );
    pfs_files[file_id]->name = (char*)pfs_malloc( strlen(to)+1 );
    memcpy( pfs_files[file_id]->name, to, strlen(to)+1 );
    return 0;
  }

  int dir_id = pfs_find_dir( to );
  if( dir_id > -1 ) {
    // destination dir already exists, unlink first ?
    return -1;
  }
  dir_id = pfs_find_dir( from );
  if( dir_id > -1 ) {
    free( pfs_dirs[dir_id]->name );
    pfs_dirs[dir_id]->name = (char*)pfs_malloc( strlen(to)+1 );
    memcpy( pfs_dirs[dir_id]->name, to, strlen(to)+1 );
    return 0;
  }

  return -1;
}


pfs_dir_t* pfs_opendir( const char * path )
{

  int file_id = pfs_find_file( path );
  if( file_id > -1 ) {
    ESP_LOGW(TAG, "Can't create dir(%s) as a file already exists with the same name", path );
    return NULL;
  }

  int dir_id = pfs_find_dir( path );
  if( dir_id > -1 ) {
    // directory exists, no need to create
    return pfs_dirs[dir_id];
  }

  return NULL;
}


int pfs_mkdir( const char* path )
{
  int dir_id = pfs_find_dir( path );
  if( dir_id > -1 ) {
    // directory exists, no need to create
    return 0;
  }

  int slotscount = 0;
  int dirslot = pfs_next_dir_avail();
  pfs_dirs[dirslot]->name = (char*)pfs_calloc(1, sizeof( path ) +1 );

  if( pfs_dirs[dirslot] == NULL || pfs_dirs[dirslot]->name == NULL ) {
    ESP_LOGE(TAG, "Failed to create dir %s", path );
    return 1;
  }

  pfs_dirs[dirslot]->dir_id = dirslot;
  memcpy( pfs_dirs[dirslot]->name, path, sizeof( path ) +1 );

  ESP_LOGD(TAG, "Created dir %s", path );
  return 0;

}


int pfs_rmdir( const char* path )
{
  int dir_id = pfs_find_dir( path );
  if( dir_id < 0 ) {
    // directory exists, no need to create
    return -1;
  }
  free( pfs_dirs[dir_id]->name );
  pfs_dirs[dir_id]->name = NULL;
  return 0;
}


struct dirent * pfs_readdir( pfs_dir_t * dir )
{
  ESP_LOGD(TAG, "[FIXME] Fake readdir (does nothing)");
  return NULL;
}


void pfs_closedir( pfs_dir_t * dir )
{
  ESP_LOGD(TAG, "[FIXME] Fake closedir (does nothing)");
  return;
}


void pfs_rewinddir( pfs_dir_t * dir )
{
  // makes no sense (yet?) to support that
  ESP_LOGD(TAG, "[FIXME] Fake rewinddir (does nothing)");
  return;
}







int vfs_pfs_fopen( const char * path, int flags, int mode )
{

